simulation/993-fan-baseline/caseA_published/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// M64 fan-baseline deck | tag: SURROGATE (exploratory; placeholder BCs)
convertToMeters 1.0;
vertices
(
    (0.000000 0.050000 0.000000)
    (0.000000 0.080400 0.000000)
    (0.000000 0.000000 0.080400)
    (0.000000 0.000000 0.050000)
    (0.304000 0.050000 0.000000)
    (0.304000 0.080400 0.000000)
    (0.304000 0.000000 0.080400)
    (0.304000 0.000000 0.050000)
    (0.000000 -0.080400 0.000000)
    (0.000000 -0.050000 0.000000)
    (0.304000 -0.080400 0.000000)
    (0.304000 -0.050000 0.000000)
    (0.000000 -0.000000 -0.080400)
    (0.000000 -0.000000 -0.050000)
    (0.304000 -0.000000 -0.080400)
    (0.304000 -0.000000 -0.050000)
    (0.000000 0.126000 0.000000)
    (0.000000 0.000000 0.126000)
    (0.304000 0.126000 0.000000)
    (0.304000 0.000000 0.126000)
    (0.000000 -0.126000 0.000000)
    (0.304000 -0.126000 0.000000)
    (0.000000 -0.000000 -0.126000)
    (0.304000 -0.000000 -0.126000)
    (0.324000 0.050000 0.000000)
    (0.324000 0.080400 0.000000)
    (0.324000 0.000000 0.080400)
    (0.324000 0.000000 0.050000)
    (0.324000 -0.080400 0.000000)
    (0.324000 -0.050000 0.000000)
    (0.324000 -0.000000 -0.080400)
    (0.324000 -0.000000 -0.050000)
    (0.324000 0.126000 0.000000)
    (0.324000 0.000000 0.126000)
    (0.324000 -0.126000 0.000000)
    (0.324000 -0.000000 -0.126000)
    (0.932000 0.050000 0.000000)
    (0.932000 0.080400 0.000000)
    (0.932000 0.000000 0.080400)
    (0.932000 0.000000 0.050000)
    (0.932000 -0.080400 0.000000)
    (0.932000 -0.050000 0.000000)
    (0.932000 -0.000000 -0.080400)
    (0.932000 -0.000000 -0.050000)
    (0.932000 0.126000 0.000000)
    (0.932000 0.000000 0.126000)
    (0.932000 -0.126000 0.000000)
    (0.932000 -0.000000 -0.126000)
);
blocks
(
    hex (0 1 2 3 4 5 6 7) (8 1 1) simpleGrading (1 1 1)
    hex (3 2 8 9 7 6 10 11) (8 1 1) simpleGrading (1 1 1)
    hex (9 8 12 13 11 10 14 15) (8 1 1) simpleGrading (1 1 1)
    hex (13 12 1 0 15 14 5 4) (8 1 1) simpleGrading (1 1 1)
    hex (1 16 17 2 5 18 19 6) (8 1 1) simpleGrading (1 1 1)
    hex (2 17 20 8 6 19 21 10) (8 1 1) simpleGrading (1 1 1)
    hex (8 20 22 12 10 21 23 14) (8 1 1) simpleGrading (1 1 1)
    hex (12 22 16 1 14 23 18 5) (8 1 1) simpleGrading (1 1 1)
    hex (4 5 6 7 24 25 26 27) (8 1 1) simpleGrading (1 1 1)
    hex (7 6 10 11 27 26 28 29) (8 1 1) simpleGrading (1 1 1)
    hex (11 10 14 15 29 28 30 31) (8 1 1) simpleGrading (1 1 1)
    hex (15 14 5 4 31 30 25 24) (8 1 1) simpleGrading (1 1 1)
    hex (5 18 19 6 25 32 33 26) (8 1 1) simpleGrading (1 1 1)
    hex (6 19 21 10 26 33 34 28) (8 1 1) simpleGrading (1 1 1)
    hex (10 21 23 14 28 34 35 30) (8 1 1) simpleGrading (1 1 1)
    hex (14 23 18 5 30 35 32 25) (8 1 1) simpleGrading (1 1 1)
    hex (24 25 26 27 36 37 38 39) (8 1 1) simpleGrading (1 1 1)
    hex (27 26 28 29 39 38 40 41) (8 1 1) simpleGrading (1 1 1)
    hex (29 28 30 31 41 40 42 43) (8 1 1) simpleGrading (1 1 1)
    hex (31 30 25 24 43 42 37 36) (8 1 1) simpleGrading (1 1 1)
    hex (25 32 33 26 37 44 45 38) (8 1 1) simpleGrading (1 1 1)
    hex (26 33 34 28 38 45 46 40) (8 1 1) simpleGrading (1 1 1)
    hex (28 34 35 30 40 46 47 42) (8 1 1) simpleGrading (1 1 1)
    hex (30 35 32 25 42 47 44 37) (8 1 1) simpleGrading (1 1 1)
);
boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4)
            (1 4)
            (2 4)
            (3 4)
            (4 4)
            (5 4)
            (6 4)
            (7 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (16 5)
            (17 5)
            (18 5)
            (19 5)
            (20 5)
            (21 5)
            (22 5)
            (23 5)
        );
    }
    hub
    {
        type wall;
        faces
        (
            (0 0)
            (1 0)
            (2 0)
            (3 0)
            (8 0)
            (9 0)
            (10 0)
            (11 0)
            (16 0)
            (17 0)
            (18 0)
            (19 0)
        );
    }
    throat
    {
        type wall;
        faces
        (
            (4 1)
            (5 1)
            (6 1)
            (7 1)
            (12 1)
            (13 1)
            (14 1)
            (15 1)
            (20 1)
            (21 1)
            (22 1)
            (23 1)
        );
    }
);
edges
(
);
// radial split R_mid=0.0804 m; hub is a wall (no wedge singularity);
// quadrant and axial interfaces become auto-matching internal faces.
