simulation/993-fan-baseline/caseA_published/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
simulationType  RAS;

RAS
{
    RASModel        kEpsilon;
    turbulence      on;
    printExtraInfo  off;
}
