simulation/993-fan-baseline/caseA_published/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
transportModel  Newtonian;
nu              nu [0 2 -1 0 0 0 0] 1.51163e-05;
