simulation/993-fan-baseline/caseA_published/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// M64 fan-baseline deck | tag: SURROGATE (exploratory; placeholder BCs)
dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    hub
    {
        type            zeroGradient;
    }
    throat
    {
        type            zeroGradient;
    }
}
