simulation/993-fan-baseline/caseA_published/0/epsilon
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
dimensions      [0 2 -3 0 0 0 0];
internalField   uniform 29.1796;
boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 29.1796;
    }
    outlet
    {
        type            zeroGradient;
    }
    hub
    {
        type            fixedValue;
        value           uniform 1e-8;
    }
    throat
    {
        type            fixedValue;
        value           uniform 1e-8;
    }
}
