simulation/993-fan-baseline/caseA_published/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.962807;
boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.962807;
    }
    outlet
    {
        type            zeroGradient;
    }
    hub
    {
        type            fixedValue;
        value           uniform 0;
    }
    throat
    {
        type            fixedValue;
        value           uniform 0;
    }
}
