simulation/993-fan-baseline/caseA_published/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0.0329959;
boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0.0329959;
    }
    outlet
    {
        type            calculated;
        value           uniform 0.0329959;
    }
    hub
    {
        type            calculated;
        value           uniform 0.0329959;
    }
    throat
    {
        type            calculated;
        value           uniform 0.0329959;
    }
}
